# PolyLine Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PolyLine Class
Members See Also
---
A polyline.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class PolyLine : GeometryObject
```

Visual Basic
---
```text
Public Class PolyLine _
	Inherits GeometryObject
```

Visual C++
---
```text
public ref class PolyLine : public GeometryObject
```

# Remarks
A polyline in space is defined by a set of coordinate points.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..GeometryObject Autodesk.Revit.DB..::..PolyLine
# See Also
PolyLine Members
Autodesk.Revit.DB Namespace